app/views/owners/index.html.erb

        <td><%= owner.phone %></td>
        <td><%= owner.pets.count %></td>
---
SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" IN (1, 2, 3)
SELECT COUNT(*) FROM "pets" WHERE "pets"."owner_id" = 1