app/views/pets/show.html.erb

SELECT "owners".* FROM "owners" WHERE "owners"."id" = 2 LIMIT 1
---
<p><strong>Weight:</strong> <%= @pet.weight %></p>
<p><strong>Owner:</strong> <%= link_to "#{@pet.owner.first_name} #{@pet.owner.last_name}", @pet.owner %></p>

SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1
---
  <tbody>
    <% @pet.appointments.upcoming.each do |appointment| %>

SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1 LIMIT 1
---
        <td><%= appointment.date.strftime("%B %d, %Y") %></td>
        <td><%= link_to "#{appointment.vet.first_name} #{appointment.vet.last_name}", appointment.vet %></td>

SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1
---
  <tbody>
    <% @pet.appointments.past.each do |appointment| %>

SELECT "vets".* FROM "vets" WHERE "vets"."id" = 10 LIMIT 1
---
        <td><%= appointment.date.strftime("%B %d, %Y") %></td>
        <td><%= link_to "#{appointment.vet.first_name} #{appointment.vet.last_name}", appointment.vet %></td>