app/views/vets/show.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."vet_id" = 1
---
  <tbody>
    <% @vet.appointments.upcoming.each do |appointment| %>

SELECT "vets".* FROM "vets" WHERE "vets"."specialization" = 'Surgery' AND "vets"."id" != 2
---
<ul>
  <% Vet.by_specialization(@vet.specialization).where.not(id: @vet.id).each do |v| %>