app/policies/appointment_policy.rb

    def resolve
      if user.admin?
        scope.all
      elsif user.vet?
        scope.where(vet: user.vet)
---
SELECT "vets".* FROM "vets" WHERE "vets"."user_id" = 3 LIMIT 1