app/policies/pet_policy.rb

SELECT "owners".* FROM "owners" WHERE "owners"."user_id" = 5 LIMIT 1
---
    def resolve
      if user.admin? || user.vet?
        scope.all
      elsif user.owner?
        scope.where(owner: user.owner)