app/policies/treatment_policy.rb

  def create?
    user.admin? || (user.vet? && user.vet.present? && record.appointment&.vet == user.vet)
---
SELECT "vets".* FROM "vets" WHERE "vets"."user_id" = 3 LIMIT 1