app/controllers/appointments_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" IN (33, 34, 31, 32, 35)
SELECT "vets".* FROM "vets" WHERE "vets"."id" IN (14, 13)
---
  def index
    authorize Appointment
    @appointments = policy_scope(Appointment).includes(:pet, :vet)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 1 LIMIT 1
---
  def show
    authorize @appointment
    @appointment = Appointment.includes(treatments: :rich_text_clinical_notes).find(params[:id])

INSERT INTO "appointments" ("created_at", "date", "pet_id", "reason", "status", "updated_at", "vet_id") VALUES ('2026-04-30 13:48:22.954645', '2026-04-09 13:50:00', 6, 'leazy', 0, '2026-04-30 13:48:22.954645', 3) RETURNING "id"
---
  def create
    @appointment = Appointment.new(appointment_params)
    authorize @appointment
    if @appointment.save