app/controllers/pets_controller.rb

  def index
    @species_list = policy_scope(Pet).distinct.pluck(:species)
    @species = params[:species]
    @pets = @species.present? ? policy_scope(Pet).by_species(@species).includes(:owner) : policy_scope(Pet).includes(:owner)
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" IN (13, 14, 15)

  def show
    authorize @pet
    @pet = Pet.includes(appointments: [:vet, :treatments]).find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = 3 LIMIT 1
SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 1
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 2

  def create
    @pet = Pet.new(pet_params)
    authorize @pet
    if @pet.save
---
INSERT INTO "pets" ("breed", "created_at", "date_of_birth", "name", "owner_id", "species", "updated_at", "weight") VALUES ('i dont know', '2026-04-30 13:47:12.928550', '2023-06-09', 'Pun pun purin', 4, 'other', '2026-04-30 13:47:12.928550', 69.0) RETURNING "id"

  def update
    authorize @pet
    if @pet.update(pet_params)
---
UPDATE "pets" SET "updated_at" = '2026-05-07 13:49:43.263471' WHERE "pets"."id" = 3

  def set_pet
    @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = 3 LIMIT 1