app/controllers/treatments_controller.rb

INSERT INTO "treatments" ("administered_at", "appointment_id", "created_at", "dosage", "medication", "name", "notes", "updated_at") VALUES ('2026-04-10 09:52:00', 9, '2026-04-30 13:49:12.980953', 'as', 'depresivos', 'mhm', 'mucho tiepo', '2026-04-30 13:49:12.980953') RETURNING "id"
---
  def create
    @treatment = @appointment.treatments.build(treatment_params)
    authorize @treatment
    if @treatment.save

UPDATE "treatments" SET "dosage" = '50mg', "medication" = 'Cumisol', "name" = 'Medicado', "notes" = 'deprecion', "updated_at" = '2026-04-30 13:55:30.217906' WHERE "treatments"."id" = 6
---
  def update
    authorize @treatment
    if @treatment.update(treatment_params)

DELETE FROM "treatments" WHERE "treatments"."id" = 4
---
  def destroy
    authorize @treatment
    @treatment.destroy

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 1 LIMIT 1
---
  def set_appointment
    @appointment = Appointment.find(params[:appointment_id])

SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 1 AND "treatments"."id" = 4 LIMIT 1
---
  def set_treatment
    @treatment = @appointment.treatments.find(params[:id])