app/controllers/vets_controller.rb

  def create
    @vet = Vet.new(vet_params)
    authorize @vet
    if @vet.save
---
INSERT INTO "vets" ("created_at", "email", "first_name", "last_name", "phone", "specialization", "updated_at") VALUES ('2026-04-30 13:47:47.632846', 'toto@dsf.cl', 'samuel', 'toroto', '234', 'see animals', '2026-04-30 13:47:47.632846') RETURNING "id"

  def set_vet
    @vet = Vet.find(params[:id])
---
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 2 LIMIT 1