app/views/appointments/show.html.erb

SELECT "vets".* FROM "vets" WHERE "vets"."id" = 2 LIMIT 1
---
<p><strong>Pet:</strong> <%= link_to @appointment.pet.name, @appointment.pet %></p>
<p><strong>Vet:</strong> <%= link_to "#{@appointment.vet.first_name} #{@appointment.vet.last_name}", @appointment.vet %></p>

SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 9
---
  <tbody>
    <% @appointment.treatments.each do |treatment| %>